Repository: SecureTrading/js-payments
Catalog: src/translations/po/*.po
Languages: sv_se

source: Field is required
sv_se: Obligatoriskt fält

source: An error occurred
sv_se: Ett fel inträffade

source: Merchant validation failure
sv_se: Verifiering av säljare misslyckades

source: Payment has been cancelled
sv_se: Betalningen har avbrutits

source: Value mismatch pattern
sv_se: Matchningsfel för värde

source: Invalid response
sv_se: Ogiltigt svar

source: Invalid request
sv_se: Ogiltig begäran

source: Value is too short
sv_se: Värdet är för kort

source: Payment has been authorized
sv_se: Betalningen har godkänts

source: Amount and currency are not set
sv_se: Summa och valuta har inte angetts

source: Payment has been successfully processed
sv_se: Betalningen lyckades

source: Card number
sv_se: Kortnummer

source: Expiration date
sv_se: Sista giltighetsdatum

source: Security code
sv_se: Säkerhetskod

source: Ok
sv_se: Betalningen lyckades

source: Method not implemented
sv_se: Metoden har inte implementerats

source: Form is not valid
sv_se: Ogiltigt formulär

source: Pay
sv_se: Betala

source: Processing
sv_se: Bearbetar

source: Invalid field
sv_se: Ogiltigt fält

source: Card number is invalid
sv_se: Ogiltigt kortnummer
