Repository: SecureTrading/js-payments
Catalog: translations/*.po
Languages: cy_gb, de_de, nl_nl, no_no

source: Timeout
cy_gb: Terfyn amser
de_de: Auszeit
no_no: Tidsavbrutt

source: Field is required
cy_gb: Mae'r maes yn ofynnol
de_de: Feld ist erforderlich
nl_nl: Dit is een verplicht veld
no_no: Feltet er obligatorisk

source: Payment is not available
de_de: Zahlung ist nicht verfügbar

source: An error occurred
cy_gb: Digwyddodd gwall
de_de: Ein Fehler ist aufgetreten
nl_nl: Er is iets misgegaan
no_no: Det inntraff en feil

source: Merchant validation failure
cy_gb: Methiant i ddilysu masnachwr
de_de: Fehler bei der Händlerprüfung
nl_nl: Validatie verkoper is mislukt
no_no: Kjøpsautorisasjonen var mislykket

source: Field is empty
de_de: Feld ist leer

source: Payment has been cancelled
cy_gb: Mae'r taliad wedi ei ganslo
de_de: Zahlung wurde storniert
nl_nl: De betaling is geannuleerd
no_no: Betalingen er annullert

source: Value mismatch pattern
cy_gb: Patrwm camgymhariad gwerth
de_de: Wertübereinstimmungsmuster
nl_nl: Invoer voldoet niet aan patroon
no_no: Verdiene stemmer ikke overens

source: Security code does not match card number
de_de: Sicherheitscode stimmt nicht mit Kartennummer überein

source: Invalid response
cy_gb: Ymateb annilys
de_de: Ungültige Antwort
nl_nl: Ongeldig antwoord
no_no: Ugyldig svar

source: Value is too short
cy_gb: Mae'r gwerth yn rhy fyr
de_de: Wert ist zu kurz
nl_nl: Invoer is te kort
no_no: Verdien er for kort

source: Invalid request
cy_gb: Cais annilys
de_de: Ungültige Anfrage
nl_nl: Ongeldig verzoek
no_no: Ugyldig forespørsel

source: Your browser does not support Apple Pay
de_de: Ihr Browser unterstützt Apple Pay nicht

source: This version of browser does not support Apple Pay
de_de: Diese Browser-Version unterstützt Apple Pay nicht

source: Payment type is not available
de_de: Zahlungsart ist nicht verfügbar

source: Payment has been authorized
cy_gb: Mae'r taliad wedi ei awdurdodi
de_de: Zahlung wurde genehmigt
nl_nl: De betaling is geautoriseerd
no_no: Betalingen er autorisert

source: Security code is too long
de_de: Sicherheitscode ist zu lang

source: Amount and currency are not set
cy_gb: Nid yw'r swm a'r arian wedi ei osod
de_de: Betrag und Währung werden nicht eingestellt
nl_nl: Bedrag en valuta zijn niet ingesteld
no_no: Beløp og valuta er ikke fastsatt

source: You have no cards in your wallet
de_de: Sie haben keine Karten in Ihrer Brieftasche

source: Card number is invalid
cy_gb: Mae rhif y cerdyn yn annilys
de_de: Kartennummer ist ungültig
nl_nl: Het kaartnummer is ongeldig
no_no: Kortnummeret er ugyldig

source: Payment has been successfully processed
cy_gb: Mae'r taliad wedi ei brosesu'n llwyddiannus
de_de: Zahlung wurde erfolgreich verarbeitet
nl_nl: De betaling is verwerkt
no_no: Betalingen er fullført

source: Card number
cy_gb: Rhif y cerdyn
de_de: Kartennummer
nl_nl: Kaartnummer
no_no: Kortnummer

source: Expiration date
cy_gb: Dyddiad dod i ben
de_de: Ablaufdatum
nl_nl: Vervaldatum
no_no: Utløpsdato

source: Security code
cy_gb: Cod diogelwch
de_de: Sicherheitscode
nl_nl: Beveiligingscode
no_no: Sikkerhetskode

source: Ok
cy_gb: Mae'r taliad wedi ei brosesu'n llwyddiannus
de_de: Zahlung wurde erfolgreich verarbeitet
nl_nl: De betaling is verwerkt

source: Method not implemented
cy_gb: Nid yw'r dull wedi ei weithredu
de_de: Methode nicht implementiert
nl_nl: De methode is niet ge√Ømplementeerd
no_no: Metoden er ikke implementert

source: Form is not valid
cy_gb: Nid yw'r ffurflen yn ddilys
nl_nl: Het formulier is ongeldig
no_no: Blanketten er ikke gyldig

source: Pay
cy_gb: Talu
nl_nl: Betalen
no_no: Betal

source: Processing
cy_gb: Wrthi'n prosesu
nl_nl: Bezig met verwerken
no_no: Behandler

source: Invalid field
cy_gb: Maes annilys
nl_nl: Ongeldig veld
no_no: Ugyldig felt
